import { Step } from "./stepData";

export const supportUsStep: Step[] = [
	{
		type: "text",
		data: "شارك الموقع ورابط الإعدادات مع أصدقائك وعائلتك، حتى تصل الفائدة لأكبر عدد ممكن. 📢",
	},
	{
		type: "link",
		data: {
			href: "https://chat.whatsapp.com/GpVDyjVulTgArIyEhZ75HO",
			text: "انضم إلى جروب الواتساب لمتابعة الجديد 💬",
		},
	},
	{
		type: "text",
		data: "إذا كنت تمتلك قناة أو صفحة على وسائل التواصل الاجتماعي، تحدث عن المشروع وساعد في نشر الوعي. 🎙️",
	},
	{
		type: "text",
		data: "🎯 الدعم المالي: يمكنك المساهمة ماديًا لدعم استمرارية المشروع وتحسين خدماته.",
	},
	{
		type: "text",
		data: "💳 الدعم عبر فودافون كاش: يمكنك التبرع عبر تحويل الأموال إلى الرقم التالي: 01005286073 📞",
	},

	{
		type: "text",
		data: "🏦 الدعم عبر إنستاباي: يمكنك التبرع مباشرة عبر تطبيق InstaPay عبر الرابط التالي: ahmed-elbehairy@instapay",
	},

	{
		type: "text",
		data: "🤝 التطوع: إذا كنت تمتلك مهارات في البرمجة، التصميم، التسويق أو أي مجال آخر، يمكنك الانضمام إلى فريقنا والمساهمة بوقتك وجهدك.",
	},
	{
		type: "link",
		data: {
			href: "https://www.mafazaa.com/join",
			text: "🚀 انضم إلى فريق التطوع",
		},
	},
	{
		type: "text",
		data: "أكبر دعم هو أن تدعو لنا بالتوفيق والقبول، نسأل الله أن يبارك في هذا العمل. ❤️",
	},
];

export const checkActivationStep: Step[] = [
	{
		type: "text",
		data: "بعد تفعيل الإعدادات، أعد تشغيل جهاز الراوتر لتطبيق التغييرات بالكامل. 🔄",
	},
	{
		type: "text",
		data: "استخدم أداة التحقق مثل SafeSearch أو أي موقع يقدم هذه الخدمة. 🔍",
	},
	{
		type: "text",
		data: "تحقق من التفعيل على جهاز آخر متصل بنفس الشبكة، للتأكد من تطبيق الحماية على الجميع. 📱",
	},
];

export const customerSupportStep: Step[] = [
	{
		type: "text",
		data: "إذا واجهت أي مشكلة أو كنت بحاجة إلى دعم، لا تتردد في التواصل معنا عبر واتساب:",
	},
	{
		type: "link",
		data: {
			href: "https://wa.me/+201005286073",
			text: "📩 تواصل عبر واتساب - 01005286073",
		},
	},
	{
		type: "link",
		data: {
			href: "https://wa.me/+201203250103",
			text: "📩 تواصل عبر واتساب - 01203250103",
		},
	},
	{
		type: "link",
		data: {
			href: "https://wa.me/+201003816322",
			text: "📩 تواصل عبر واتساب - 01003816322",
		},
	},
	{
		type: "link",
		data: {
			href: "https://chat.whatsapp.com/GpVDyjVulTgArIyEhZ75HO",
			text: "تواصل معنا على جروب الواتساب 💬",
		},
	},
	{
		type: "text",
		data: "ارسل وصفًا واضحًا للمشكلة، مع ذكر نوع الراوتر وخطوات التفعيل التي قمت بها. 🛠️",
	},
	{
		type: "text",
		data: "انتظر رد الدعم الفني، وسنساعدك بأسرع وقت ممكن لحل المشكلة. ⏳",
	},
];
